app/controllers/signin_controller.rb

  def create
    if(params[:email]==nil || params[:email] ==='')
      not_found
    else
      user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "1"], ["LIMIT", 1]]